app/controllers/tours_controller.rb

SELECT "tours".* FROM "tours" WHERE "tours"."slug" = 'blue-mountains-day-trip' LIMIT 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."tour_id" = 1 AND "reviews"."approved" = TRUE ORDER BY "reviews"."created_at" DESC LIMIT 4
---
  def show
    @tour    = Tour.friendly.find(params[:slug])
    @reviews = @tour.reviews.approved.limit(4)